Autodesk.Revit.DB.Structure.PathReinforcement.IsValidRebarShapeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement.
Remarks:
The Rebar Shape has to be two dimensional shape only
and its neighbouring segments may form only right angles.
aDoc:
The document.
elementId:
An element id.
Returns:
True if the specified element id corresponds to a Rebar Shape element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.PathReinforcement.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets Path Reinforcement to be shown unobscured in a view.
view:
The view element
unobscured:
True if Path Reinforcement is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.PathReinforcement.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if Path Reinforcement is shown unobscured in a view.
view:
The view element
Returns:
True if Path Reinforcement is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This element doesn't have valid visibility data.
Since:
2014

Autodesk.Revit.DB.Structure.PathReinforcement.ConvertRebarInSystemToRebars(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.PathReinforcement)
Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements.
doc:
The document.
system:
A PathReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.Structure.PathReinforcement.RemovePathReinforcementSystem(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.PathReinforcement)
Deletes the specified PathReinforcement, and converts its RebarInSystem
elements to equivalent Rebar elements.
doc:
The document.
system:
A PathReinforcement element in the document.
Returns:
The ids of the newly created Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element system was not found in the given document.
-or-
system does not host Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.PathReinforcement.GetOrCreateDefaultRebarShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new RebarShape object with a default name or
returns existing one which fulfills Path Reinforcement bending data requirements.
document:
The document.
rebarBarTypeId:
The id of the RebarBarType.
startRebarHookTypeId:
The id of the RebarHookType for the start of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId:
The id of the RebarHookType for the end of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no end hook.
Returns:
Rebar Shape id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
rebarBarTypeId should refer to an RebarBarType element.
-or-
startRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
endRebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
Remarks:
The method sets Rebar Shape of primary bars only.
document:
The document.
hostElement:
The element that will host the PathReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the PathReinforcement.
flip:
A flag controlling the bars relative to the curves.
pathReinforcementTypeId:
The id of the PathReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
startRebarHookTypeId:
The id of the RebarHookType for the start of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId:
The id of the RebarHookType for the end of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no end hook.
rebarShapeId:
The id of the RebarShape element that defines the shape of the rebars in the object.
Returns:
The newly created PathReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
The structural rebar is not within area and path reinforcement.
-or-
curves in curveArray are not continuous and open.
-or-
pathReinforcementTypeId should refer to an Path Reinforcement Type element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
startRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
endRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
rebarShapeId should refer to two dimensional Rebar Shape element with segments forming only right angles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
startRebarHookTypeId cannot be set for given rebar shape.
-or-
endRebarHookTypeId cannot be set for given rebar shape.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.
Remarks:
The method sets Rebar Shape of primary bars only.
document:
The document.
hostElement:
The element that will host the PathReinforcement. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
curveArray:
An array of curves that will define the outline of the PathReinforcement.
flip:
A flag controlling the bars relative to the curves.
pathReinforcementTypeId:
The id of the PathReinforcementType.
rebarBarTypeId:
The id of the RebarBarType.
startRebarHookTypeId:
The id of the RebarHookType for the start of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no start hook.
endRebarHookTypeId:
The id of the RebarHookType for the end of the bar.
If this parameter is InvalidElementId, it means to create a rebar with no end hook.
Returns:
The newly created PathReinforcement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curveArray is empty.
-or-
The input curveArray contains at least one helical curve and is not supported for this operation.
-or-
The element hostElement was not found in the given document.
-or-
the host Element is not a valid host for Area Reinforcement, Path Reinforcement, Fabric Area or Fabric Sheet.
-or-
curves in curveArray are not continuous and open.
-or-
pathReinforcementTypeId should refer to an Path Reinforcement Type element.
-or-
rebarBarTypeId should refer to an RebarBarType element.
-or-
startRebarHookTypeId should be invalid or refer to an RebarHookType element.
-or-
endRebarHookTypeId should be invalid or refer to an RebarHookType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Since:
2015

Autodesk.Revit.DB.Structure.PathReinforcement.AlternatingBarShapeId
The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement.
Remarks:
Changing the value of this property causes the Path Reinforcement to choose values for its
shape parameters.
Before calling this method, alternating bars have to be enabled in the Path Reinforcement by setting PATH_REIN_ALTERNATING BuiltInParameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This Path Reinforcement does not have alternating bars enabled.
-or-
When setting this property: This PathReinforcement does not host Rebar.
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.PrimaryBarShapeId
The RebarShape element that defines the shape of the primary bars of the Path Reinforcement.
Remarks:
Changing the value of this property causes the Path Reinforcement to choose values for its
shape parameters.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId should refer to two dimensional Rebar Shape element with segments forming only right angles.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This PathReinforcement does not host Rebar.
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.AdditionalOffset
Additional offset of rebars in the Path Reinforcement.
Remarks:
The method moves both primary and alternating bars.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be no more than 30000 feet in absolute value.
Since:
2014

Autodesk.Revit.DB.Structure.PathReinforcement.PathReinforcementType
Retrieves the type of the Path Reinforcement.

Autodesk.Revit.DB.Structure.PathReinforcement.AlternatingBarOrientation
Orientation of alternating bars of Path Reinforcement.
Remarks:
The orientation corresponds to the bars' rotation in the Path Reinforcement element.
It indicates the postion of the major segment of the alternating Rebar Shape relative to the edges of a rectangular region
which bounds the Path Reinforcement, where the top/exterior and bottom/interior come from the cover boundaries of the host,
the near side edge is defined by the Path Reinforcement sketch line, and the far side edge is derived from bar length (defaulting to 5').
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: This orientation is not allowed for alternating bars.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.PathReinforcement.PrimaryBarOrientation
Orientation of primary bars of Path Reinforcement.
Remarks:
The orientation corresponds to the bars' rotation in the Path Reinforcement element.
It indicates the postion of the major segment of the primary Rebar Shape relative to the edges of a rectangular region
which bounds the Path Reinforcement, where the top/exterior and bottom/interior come from the cover boundaries of the host,
the near side edge is defined by the Path Reinforcement sketch line, and the far side edge is derived from bar length (defaulting to 5').
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: This orientation is not allowed for primary bars.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2016